#include <stdio.h>

int main (void) 
{
    printf("\"I'm Groot\" (c) Groot");

    return 0;
}


// Уровень: 1
// Темы: Ввод/вывод данных..
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: -
// Выходные данные: стандартный поток вывода (stdout)

// Написать программу для вывода на стандартный поток знаменитой фразы: "I'm Groot" (c) Groot
// В конце ответа не должно быть переноса на новую строку.

// | Входные данные | Результат работы |
// | | "I'm Groot" (c) Groot |
