// #include <stdio.h>
// int main (void)
// {
// 	int x = 0;

// 	scanf ("%d", &x);
// 	printf("%05d", x);
// 	return 0;
// }


#include <stdio.h>

int main (void)
{
    int x;

    scanf ("%d", &x);
    printf("%05d", x);
    
    return 0;
}

// Уровень: 1
// Темы: Ввод/вывод данных..
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: -
// Выходные данные: стандартный поток вывода (stdout)

// Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую 
// строку.
// | Входные данные | Результат работы |
// | 0 | 00000 |
// | 1 | 00001 |
// | -10 | -0010 |
// | 666666 | 666666 |
