#include <stdio.h>

int main (void)
{
	int x = 205;

	printf("%d", x);
    
	return 0;
}


// Уровень: 1
// Темы: Ввод/вывод данных..
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: -
// Выходные данные: стандартный поток вывода (stdout)

// Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. Программа должна вывести на экран число 205.
// В конце ответа не должно быть переноса на новую строку.

