#include <stdio.h>

int main (void)
{
    printf("C:\\Windows\\System32\\notepad.exe");

    return 0;
}



// Уровень: 1
// Темы: Ввод/вывод данных..
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: -
// Выходные данные: стандартный поток вывода (stdout)

// Предположим, что операционная система Windows установлена на диск С:,
// требуется написать программу для вывода полного пути до стандартной программы блокнот: C:\Windows\System32\notepad.exe
// В конце ответа не должно быть переноса на новую строку.

// Примечание: Полный или абсолютный путь - это путь, который указывает на одно и то же место в файловой системе, вне зависимости от текущего рабочего каталога.
// Полный путь в Windows всегда начинается с имени диска.

// | Входные данные | Результат работы |
// | | C:\Windows\System32\notepad.exe |
