// #include <stdio.h>

// int main(void)
// {
// 	int x = 0; pi = 3.141;

// 	scanf("%d", &x);
// 	printf("%.2f"，pi * x);

// 	return 0;
// }



#include <stdio.h>

int main(void)
{
    int x;
    double pi = 3.141;

    scanf("%d", &x);
    printf("%.2lf", pi * x);

    return 0;
}


// Уровень: 1
// Темы: базовые типы данных, объявление переменных, оператор присваивания.
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: стандартный поток ввода (stdin)
// Выходные данные: стандартный поток вывода (stdout)

// При написании программы была допущена ошибка. Необходимо исправить синтаксические, стилевые ошибки, не изменяя работу программы.
// В конце ответа не должно быть переноса на новую строку.

// | Входные данные | Результат работы |
// | 0 | 0.00 |
// | 2 | 6.28 |
