// #include <stdio.h>

// int main(void)
// {
// 	int left = 2, int right = 1;
// 	scanf("%d %d", &left, &right);
// 	printf("%d", left * right);

// 	return 0;
// }




#include <stdio.h>

int main(void)
{
	int left, right;

	scanf("%d%d", &left, &right);
	printf("%d", left * right);

	return 0;
}

// Уровень: 1
// Темы: базовые типы данных, объявление переменных, оператор присваивания.
// Директория для решения: src/
// Файлы решения: main.c
// Входные данные: стандартный поток ввода (stdin)
// Выходные данные: стандартный поток вывода (stdout)

// При написании программы была допущена ошибка. Необходимо исправить синтаксические, стилевые ошибки, не изменяя работу программы.
// В конце ответа не должно быть переноса на новую строку.

// | Входные данные | Результат работы |
// | 2 2 | 4 |
// | -4 4 | -16 |